Revit 2027 API
AreaTagFilter Class
 A filter used to match area tags.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.AreaTagFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaTagFilter : ElementSlowFilter
Public Class AreaTagFilter
	Inherits ElementSlowFilter
public ref class AreaTagFilter : public ElementSlowFilter
type AreaTagFilter =
    class
        inherit ElementSlowFilter
    end
The AreaTagFilter type exposes the following members.
Constructors
Name | Description
AreaTagFilter |  Constructs a filter which matches only areas.
Top
Properties
Name | Description
Inverted |  True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
(Inherited from ElementFilter)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ElementFilter)
Top
Methods
Name | Description
Dispose
(Inherited from ElementFilter)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
PassesFilter(Element) |  Applies the filter to a given element.
(Inherited from ElementFilter)
PassesFilter(Document, ElementId) |  Applies the filter to a given element.
(Inherited from ElementFilter)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.
See Also
Reference
Autodesk.Revit.DB Namespace